app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.task_creator_id = current_task_creator.id

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("task_creator_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["task_creator_id", 1], ["title", "title"], ["description", "description"], ["created_at", "2018-08-25 09:05:09.670956"], ["updated_at", "2018-08-25 09:05:09.670956"]]

  def add_guest
    return if params[:guest].blank? || params[:guest][:email].blank?
    guest = Guest.new
    guest.email = params[:guest][:email]
    guest.task_id = params[:task_id]
    guest.save!
---
INSERT INTO "guests" ("task_id", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["task_id", 1], ["email", "dadsadsa"], ["created_at", "2018-08-26 14:51:39.617264"], ["updated_at", "2018-08-26 14:51:39.617264"]]

    def set_task
      @task = current_task_creator.tasks.find(params[:format])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."task_creator_id" = ? AND "tasks"."id" = ? LIMIT ?  [["task_creator_id", 1], ["id", 6], ["LIMIT", 1]]